from collections import Counter
import re

def top_n_words(filename, n=500, exclude_words = None):
    """Находит n самых часто встречающихся слов в файле."""
    word_counts = Counter()
    with open(filename, 'r', encoding='utf-8') as f:  # Укажите кодировку файла
        for line in f:
            # Очистка текста (удалить пунктуацию, привести к нижнему регистру)
            line = re.sub(r'[^\w\s]', '', line).lower()
            words = line.split()
            words = [word for word in words if word not in exclude_words]
            word_counts.update(words)

    return word_counts.most_common(n)

russian_stopwords = set([
    'и', 'в', 'во', 'не', 'что', 'он', 'на', 'я', 'с', 'со', 'как',
    'а', 'то', 'все', 'она', 'так', 'его', 'но', 'из', 'у', 'к', 'до',
    'за', 'бы', 'по', 'только', 'ее', 'мне', 'было', 'вот', 'от', 'меня',
    'еще', 'нет', 'о', 'из', 'же', 'быть', 'был', 'них', 'сейчас', 'при',
    'ли', 'сам', 'себя', 'свои', 'мой', 'эта', 'этот', 'эти', 'тогда',
    'когда', 'где', 'было', 'есть', 'будет', 'для', 'всех', 'вы', 'они',
    'мы', 'тот', 'там', 'ты', 'ни', 'даже', 'если', 'ему', 'вам', 'ответ',
    'вопрос', 'их', 'м', 'слово', '1', '2', 'это', 'этого', '3', 'слова', 
    "или", "одной", "после", "назовите", "словами", "показать", "году", "название", 
    "время", "двумя", "можно", "один", "словом", "чтобы", "была", "заменили", "говоря", 
    "вторая", "своем", "года", "икс", "который", "этом", "два", "были", "под", "имя", 
    "этой", "века", "вопроса", "чем", "кто", "n", "напишите", "одного", "речь", "какое", 
    "того", "гавтор", "которые", "вопросе", "одном", "одном", "человека", "её", "именно", 
    "которой", "г", "согласно", "об", "лет", "человек", "одним", "поэтому", "три", 
    "более", "очень", "идет", "второй", "пропуск", "уже", "без", "перед", "какой", 
    "может", "несколько", "тоже", "какие", "эту", "4", "5", "6", "7", "8", "9", "которого",
    "него", "первый", "является", "чего", "также", "однако", "слов", "изза", "называется", "например",
    "одну", "буквы", "двух", "котором", "ответьте", "им", "тем", "всего", "своей", "которых", "10", "внимание",
    "мнению" , "ответкомментарий", "раз", "через", "стал", "12", "сделать", "автора", "называют",
    "такой", "одна", "пишет", "хотя", "хотя", "людей", "ведущему", "букву", "игра", "15", "однажды", "часто", "всё",
    "показатьапелляции", "порядке"
    # Добавьте сюда другие слова, которые хотите исключить
    ])

top_words = top_n_words("C:/Users/User/Desktop/ПарсингЧГК/Игры_ответы", 500, exclude_words=russian_stopwords)
for i, (word, count) in enumerate(top_words):
    print(f"{i+1} место: {word} - {count}")